In [60]:
import pandas as pd 
from math import *
import numpy as np

In [61]:
data = pd.read_csv('data.csv', index_col=0)

In [62]:
data.head()

     X   Y  Class
id
1   28  10      1
2   49  49      1
3   48  35      0
4   36  33      1
5   45  54      0

In [63]:
data.columns

Index(['X', 'Y', 'Class'], dtype='object')

In [64]:
X = data['X'].to_numpy()
Y = data['Y'].to_numpy()

In [65]:
x, y = 33, 47

In [66]:
D = np.sqrt((X-x)**2 + (Y-y)**2)
print(D)
D = pd.DataFrame(D, index=range(1, len(D)+1), columns=['D'])
D.head()

[37.33630941 16.1245155  19.20937271 14.31782106 13.89244399]

           D
1  37.336309
2  16.124515
3  19.209373
4  14.317821
5  13.892444

In [73]:
w = 1/(D**2)

In [67]:
data['D'] = D

In [74]:
data['w'] = w

In [75]:
data.head()

     X   Y  Class          D         w
id
1   28  10      1  37.336309  0.000717
2   49  49      1  16.124515  0.003846
3   48  35      0  19.209373  0.002710
4   36  33      1  14.317821  0.004878
5   45  54      0  13.892444  0.005181

In [77]:
data[data['Class']==1]['w'].sum()

0.00944156274141927